app/Controllers/Livro.php

    public function index()
    {
        $dados = $this->livroModel->findAll();
        $dadosobra = $this->obraModel->findAll();
---
SELECT *
FROM `livro`
SELECT *
FROM `obra`